Repository: ip342/GF2
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: es_es

source: Line number
es_es: Número de línea

source: , Character
es_es: , Carácter

source: Close
es_es: Cerrar

source: &About
es_es: &Acerca de

source: &Exit
es_es: &Salir

source: &File
es_es: &Archivo

source: SIGNALS TO MONITOR
es_es: SEÑALES PARA MONITOREAR

source: ALL
es_es: TODOS

source: Cycles
es_es: Ciclos

source: Switch
es_es: Interruptor

source: CONTROLS
es_es: CONTROL

source: Continue
es_es: Seguir

source: Run
es_es: Ejecutar

source: Set
es_es: Establecer

source: Load New
es_es: Cargar nueva

source: Reset
es_es: Reiniciar

source: Continuous
es_es: Continuo

source: Start/Stop
es_es: Iniciar/Parar

source: Logic Simulator Created by Mojisola Agboola 2017
es_es: Simulador de lógica Creado por Mojisola Agboola 2017

source: No definition file loaded.
es_es: No se ha cargado ningún archivo de definición.

source: Open Definition file
es_es: Abrir archivo de definición

source: Definition file '{}' contains {} error.
es_es: Archivo de definición ‘{}’ contiene {} error.

source: Definition file '{}' contains {} errors.
es_es: Archivo de definición ‘{}’ contiene {} errores.

source: Switch {} set to {}.
es_es: Cambie {} a {}.

source: Success!
es_es: ¡Éxito!

source: Already monitoring {}.
es_es: Ya estoy monitoreando {}.

source: Not currently monitoring {}.
es_es: Actualmente no se está monitoreando {}.

source: Network oscillating.
es_es: Red oscilante.

source: Nothing to continue. Run first.
es_es: Nada para continuar. Corre primero.

source: DEVICES already defined.
es_es: DEVICES ya definidos.

source: CONNECTIONS already defined.
es_es: CONNECTIONS ya definidas.

source: MONITORS already defined.
es_es: MONITORS YA DEFINIDOS.

source: Cannot define MONITORS before CONNECTIONS.
es_es: No se pueden definir MONITORS antes de CONNECTIONS.

source: %s section missing
es_es: %s sección faltante

source: %s is an invalid header
es_es: %s es un encabezado no válido

source: Expected a header
es_es: Se esperaba un encabezado

source: Expecting opening square bracket after section header
es_es: Esperando abrir corchete después encabezado de sección

source: Device name '{}' has already been assigned.
es_es: Nombre del dispositivo '{}' ya ha sido asignado.

source: Expecting a device name.
es_es: Esperando el nombre de un dispositivo.

source: Expecting comma or equals.
es_es: Esperando coma o igual.

source: Expected a device type
es_es: Se esperaba un tipo de dispositivo

source: %s is an invalid device type.
es_es: %s es un tipo de dispositivo no válido.

source: Switch can only take state 0 or 1
es_es: El interruptor solo puede tomar estado 0 o 1

source: Siggen can only take binary waveforms.
es_es: Siggen solo puede tomar formas de onda binarias.

source: Device doesn't exist.
es_es: El dispositivo no existe.

source: Device can only have 1-16 inputs.
es_es: El dispositivo solo puede tener 1-16 entradas.

source: Device parameter has not been specified.
es_es: El parámetro del dispositivo no se ha especificado.

source: Cannot specify inputs for {}
es_es: No se pueden especificar entradas para {}

source: Expected ';' to end device line.
es_es: Esperado ‘;’ para finalizar la línea del dispositivo.

source: The following device(s) do not have connections defined: %s
es_es: Los siguientes dispositivos no tienen conexiones definidas: %s

source: List of connections must start with the word 'device'.
es_es: La lista de conexiones debe comenzar con la palabra 'device'.

source: Connections for device '{}' already assigned.
es_es: Conexiones para el dispositivo '{}' ya asignadas.

source: Device '{}' does not exist.
es_es: El dispositivo '{}' no existe.

source: Expected a device name after the word 'device'.
es_es: Se esperaba un nombre de dispositivo después de palabra 'device'.

source: Expected '{' after device name.
es_es: Se esperaba '{' después del nombre del dispositivo.

source: Device {} has not had all inputs defined
es_es: El dispositivo {} no ha definido todas las entradas

source: Device '{}' already assigned for monitoring.
es_es: Dispositivo '{}' ya asignado para supervisión.

source: %s is not a valid device.
es_es: %s no es un dispositivo válido.

source: DTYPE can only use .Q or .QBAR
es_es: DTYPE solo puede usar .Q o .QBAR

source: DTYPE must be followed by .
es_es: DTYPE debe ser seguido por .

source: Invalid symbol
es_es: Símbolo inválido

source: Expected '}' to end connections subsection.
es_es: Se esperaba '}' para finalizar la subsección de conexiones.

source: Connection must start with a device name.
es_es: La conexión debe comenzar con un nombre de dispositivo.

source: Expected '.' after DTYPE name.
es_es: Esperado '.' después del nombre DTYPE.

source: Invalid DTYPE output name
es_es: Nombre de salida DTYPE no válido

source: Expected '->' inbetween
es_es: Se esperaba ‘->’ entre

source: start and end connections.
es_es: conexiones de inicio y fin.

source: A device name must follow the connection arrow.
es_es: El nombre del dispositivo debe seguir la flecha de conexión.

source: This connection has been listsed under the incorrect device subsection.
es_es: Esta conexión se ha enumerado en la subsección de dispositivo incorrecta.

source: Expected '.' after device name
es_es: Esperado '.' después del nombre del dispositivo

source: Invalid port name.
es_es: Nombre de puerto no válido.

source: {}.{} is already connected.
es_es: {}. {} ya está conectado.

source: Invalid port index.
es_es: Índice de puerto no válido.

source: Expected ';' to end connection line.
es_es: Esperado ‘;’ para finalizar la línea de conexión.

source: Expected # at the end of multi-line comment
es_es: Se esperaba # al final del comentario de varias líneas

source: Expected '/' after '/' to indicate comment
es_es: Se esperaba '/' después de '/' para indicar comentario

source: Unexpected character, expected '>' after '-'
es_es: Carácter inesperado, esperado ‘>’ después de ‘-‘

source: Unexpected character, '>' must follow '-'
es_es: Carácter inesperado, ‘>’ debe seguir ‘-‘

source: Invalid character
es_es: Carácter invalido
